## Task

In this compulsory task you will clean the country column and parse the date column in the **store_income_data_task.csv** file.

In [4]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns



# Load up store_income_data.csv
df = pd.read_csv('store_income_data_task.csv')
df.head()

,id,store_name,store_email,department,income,date_measured,country
0,1,"Cullen/Frost Bankers, Inc.",NaN,Clothing,$54438554.24,4-2-2006,United States/
1,2,Nordson Corporation,NaN,Tools,$41744177.01,4-1-2006,Britain
2,3,"Stag Industrial, Inc.",NaN,Beauty,$36152340.34,12-9-2003,United States
3,4,FIRST REPUBLIC BANK,ecanadine3@fc2.com,Automotive,$8928350.04,8-5-2006,Britain/
4,5,Mercantile Bank Corporation,NaN,Baby,$33552742.32,21-1-1973,United Kingdom

1. Take a look at all the unique values in the "country" column. Then, convert the column to lowercase and remove any trailing white spaces.

In [28]:
df['country'] = df['country'].str.lower().str.strip()
df['country'].unique()

array(['united states/', 'britain', 'united states', 'britain/',
       'united kingdom', 'u.k.', 'sa', 'u.k/', 'america', nan, 's.a.',
       'england', 'uk', 's.a./', 'u.k', 'america/', 'sa.', '', 'uk.',
       'england/', 'united states of america', 'uk/', 'sa/', 'england.',
       'america.', 's.a..', 'united states of america.',
       'united states of america/', 'united states.',
       's. africasouth africa', 'britain.', '/', 'united kingdom.',
       's. africasouth africa/', 'united kingdom/',
       's. africasouth africa.', '.'], dtype=object)

2. Note that there should only be three separate countries. Eliminate all variations, so that 'South Africa', 'United Kingdom' and 'United States' are the only three countries.

In [72]:
df.replace("sa", "south africa", inplace=True)
df.replace("s.a", "south africa", inplace=True)
df.replace("s.a.", "south africa", inplace=True)
df.replace("s.a./", "south africa", inplace=True)
df.replace("sa.", "south africa", inplace=True)
df.replace("sa/", "south africa", inplace=True)
df.replace("s.a..", "south africa", inplace=True)
df.replace("s. africasouth africa.", "south africa", inplace=True)
df.replace("s. africasouth africa", "south africa", inplace=True)
df.replace("s. africasouth africa/", "south africa", inplace=True)
df.replace("britain", "united kingdom", inplace=True)
df.replace("u.k", "united kingdom", inplace=True)
df.replace("uk/", "united kingdom", inplace=True)
df.replace("england", "united kingdom", inplace=True)
df.replace("uk.", "united kingdom", inplace=True)
df.replace("u.k.", "united kingdom", inplace=True)
df.replace("england/", "united kingdom", inplace=True)
df.replace("u.k/", "united kingdom", inplace=True)
df.replace("britain/", "united kingdom", inplace=True)
df.replace("united kingdom/", "united kingdom", inplace=True)
df.replace("uk", "united kingdom", inplace=True)
df.replace("britain.", "united kingdom", inplace=True)
df.replace("united kingdom.", "united kingdom", inplace=True)
df.replace("england.", "united kingdom", inplace=True)
df.replace("america", "united states", inplace=True)
df.replace("america.", "united states", inplace=True)
df.replace("united states of america", "united states", inplace=True)
df.replace("united states of america.", "united states", inplace=True)
df.replace("united states of america/", "united states", inplace=True)
df.replace("united states.", "united states", inplace=True)
df.replace("united states/", "united states", inplace=True)
df.replace("america/", "united states", inplace=True)
df['country'].unique()

array(['united states', 'united kingdom', 'south africa', nan, '', '/',
       '.'], dtype=object)

3. Create a new column called `days_ago` in the DataFrame that is a copy of the 'date_measured' column but instead it is a number that shows how many days ago it was measured from the current date. Note that the current date can be obtained using `datetime.date.today()`.

In [77]:
df['days_ago'] = df['date_measured']
df.head()

,id,store_name,store_email,department,income,date_measured,country,days_ago
0,1,"Cullen/Frost Bankers, Inc.",NaN,Clothing,$54438554.24,4-2-2006,united states,4-2-2006
1,2,Nordson Corporation,NaN,Tools,$41744177.01,4-1-2006,united kingdom,4-1-2006
2,3,"Stag Industrial, Inc.",NaN,Beauty,$36152340.34,12-9-2003,united states,12-9-2003
3,4,FIRST REPUBLIC BANK,ecanadine3@fc2.com,Automotive,$8928350.04,8-5-2006,united kingdom,8-5-2006
4,5,Mercantile Bank Corporation,NaN,Baby,$33552742.32,21-1-1973,united kingdom,21-1-1973